app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: User.all, status: :ok

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "yonathalmeida@gmail.com"], ["LIMIT", 1]]
---
  def show
    respond_with User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "yonathalmeida@gmail.com"], ["LIMIT", 1]]
---
  def update
    user = User.find(params[:id])